vertical-pod-autoscaler/experiments/sn-pbr-throughput/14minus/user.log
Running 15m test @ http://10.98.127.92:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 26.121ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 31.216ms, rate sampling interval: 95ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   286.44ms  264.20ms   1.23s    83.71%
    Req/Sec    14.73     11.99    42.00     52.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  220.54ms
 75.000%  382.98ms
 90.000%  608.26ms
 99.000%    1.23s 
 99.900%    2.02s 
 99.990%    2.28s 
 99.999%    2.35s 
100.000%    2.35s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.515     0.000000            1         1.00
      42.911     0.100000         2656         1.11
      78.271     0.200000         5305         1.25
     120.575     0.300000         7957         1.43
     168.575     0.400000        10609         1.67
     220.543     0.500000        13264         2.00
     248.575     0.550000        14592         2.22
     276.735     0.600000        15924         2.50
     306.431     0.650000        17241         2.86
     341.247     0.700000        18572         3.33
     382.975     0.750000        19891         4.00
     407.295     0.775000        20555         4.44
     434.175     0.800000        21217         5.00
     467.199     0.825000        21880         5.71
     505.087     0.850000        22547         6.67
     552.447     0.875000        23212         8.00
     577.535     0.887500        23542         8.89
     608.255     0.900000        23871        10.00
     646.655     0.912500        24205        11.43
     689.663     0.925000        24535        13.33
     743.935     0.937500        24864        16.00
     771.583     0.943750        25033        17.78
     800.255     0.950000        25195        20.00
     837.119     0.956250        25361        22.86
     882.175     0.962500        25529        26.67
     931.327     0.968750        25693        32.00
     965.119     0.971875        25779        35.56
     999.423     0.975000        25858        40.00
    1034.239     0.978125        25941        45.71
    1083.391     0.981250        26025        53.33
    1126.399     0.984375        26108        64.00
    1157.119     0.985938        26149        71.11
    1197.055     0.987500        26190        80.00
    1216.511     0.989062        26231        91.43
    1255.423     0.990625        26273       106.67
    1300.479     0.992188        26314       128.00
    1331.199     0.992969        26336       142.22
    1379.327     0.993750        26357       160.00
    1419.263     0.994531        26376       182.86
    1491.967     0.995313        26397       213.33
    1561.599     0.996094        26418       256.00
    1619.967     0.996484        26428       284.44
    1672.191     0.996875        26439       320.00
    1734.655     0.997266        26449       365.71
    1785.855     0.997656        26459       426.67
    1853.439     0.998047        26470       512.00
    1886.207     0.998242        26475       568.89
    1924.095     0.998437        26480       640.00
    1946.623     0.998633        26485       731.43
    1991.679     0.998828        26490       853.33
    2028.543     0.999023        26496      1024.00
    2037.759     0.999121        26498      1137.78
    2052.095     0.999219        26501      1280.00
    2094.079     0.999316        26503      1462.86
    2115.583     0.999414        26506      1706.67
    2150.399     0.999512        26509      2048.00
    2166.783     0.999561        26510      2275.56
    2199.551     0.999609        26511      2560.00
    2213.887     0.999658        26512      2925.71
    2234.367     0.999707        26514      3413.33
    2240.511     0.999756        26516      4096.00
    2240.511     0.999780        26516      4551.11
    2240.511     0.999805        26516      5120.00
    2254.847     0.999829        26517      5851.43
    2275.327     0.999854        26518      6826.67
    2275.327     0.999878        26518      8192.00
    2289.663     0.999890        26519      9102.22
    2289.663     0.999902        26519     10240.00
    2289.663     0.999915        26519     11702.86
    2291.711     0.999927        26520     13653.33
    2291.711     0.999939        26520     16384.00
    2291.711     0.999945        26520     18204.44
    2291.711     0.999951        26520     20480.00
    2291.711     0.999957        26520     23405.71
    2353.151     0.999963        26521     27306.67
    2353.151     1.000000        26521          inf
#[Mean    =      286.441, StdDeviation   =      264.204]
#[Max     =     2351.104, Total count    =        26521]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26848 requests in 15.00m, 351.42MB read
  Socket errors: connect 0, read 0, write 6, timeout 0
Requests/sec:     29.83
Transfer/sec:    399.80KB